tutorials/oldd/box/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------* \
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(inlet_cyc|outlet_cyc)"
    {
        type            cyclicAMI;
        value           $internalField;
    }

    "(bottom_cyc|top_cyc)"
    {
      type freestream;
      value $internalField;
    }
    
    emptyPatches_empt
    {
        type           empty;
    }
        

}

// ************************************************************************* //
