tutorials/oldd/box/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
2370
(
3
3
3
3
3
3
2.75892
3
...
)
;

boundaryField
{
    emptyPatches_empt
    {
        type            empty;
    }

    "(bottom_cyc|top_cyc)"
    {
      type freestreamPressure;
      freestreamValue 3;
    }
    
    inlet_cyc
    {
        type            cyclicAMI;
        value           uniform 3;
    }
    outlet_cyc
    {
        type            cyclicAMI;
        value           uniform 3;
    }
}


// ************************************************************************* //
