tutorials/oldd/box/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
2370
(
1
1
1
1
1
1
0.932571
1
...
)
;

boundaryField
{
    emptyPatches_empt
    {
        type            empty;
    }
   
    "(bottom_cyc|top_cyc)"
    {
      type freestream;
      value 1;
    }
    
    inlet_cyc
    {
        type            cyclicAMI;
        value           uniform 1;
    }
    outlet_cyc
    {
        type            cyclicAMI;
        value           uniform 1;
    }
}


// ************************************************************************* //
